IT-Church/FocRot_FW/C30/v3.31/support/PIC24F/h/p24FJ64GC008.h
extern volatile ADTH0LBITS ADTH0Lbits __attribute__((__sfr__));

extern volatile unsigned int  ADTH0H __attribute__((__sfr__));
typedef struct tagADTH0HBITS {
  unsigned TH0:1;
  unsigned TH1:1;
  unsigned TH2:1;
  unsigned TH3:1;
  unsigned TH4:1;
  unsigned TH5:1;
  unsigned TH6:1;
  unsigned TH7:1;
  unsigned TH8:1;
  unsigned TH9:1;
  unsigned TH10:1;
  unsigned TH11:1;
  unsigned TH12:1;
  unsigned TH13:1;
  unsigned TH14:1;
  unsigned TH15:1;
} ADTH0HBITS;
extern volatile ADTH0HBITS ADTH0Hbits __attribute__((__sfr__));

extern volatile unsigned long longADL0MSEL __attribute__((__sfr__));
extern volatile unsigned int  ADL0MSEL0 __attribute__((__sfr__));
typedef struct tagADL0MSEL0BITS {
  unsigned :15;
  unsigned MSEL15:1;
} ADL0MSEL0BITS;
extern volatile ADL0MSEL0BITS ADL0MSEL0bits __attribute__((__sfr__));

extern volatile unsigned int  ADL0MSEL1 __attribute__((__sfr__));
typedef struct tagADL0MSEL1BITS {
  unsigned MSEL16:1;
  unsigned MSEL17:1;
  unsigned MSEL18:1;
  unsigned MSEL19:1;
  unsigned MSEL20:1;
  unsigned MSEL21:1;
  unsigned MSEL22:1;
  unsigned MSEL23:1;
  unsigned MSEL24:1;
  unsigned MSEL25:1;
  unsigned MSEL26:1;
  unsigned MSEL27:1;
  unsigned MSEL28:1;
  unsigned MSEL29:1;
  unsigned MSEL30:1;
  unsigned MSEL31:1;
} ADL0MSEL1BITS;
extern volatile ADL0MSEL1BITS ADL0MSEL1bits __attribute__((__sfr__));

extern volatile unsigned int  ADL0MSEL2 __attribute__((__sfr__));
typedef struct tagADL0MSEL2BITS {
  unsigned MSEL32:1;
  unsigned MSEL33:1;
  unsigned MSEL34:1;
  unsigned MSEL35:1;
  unsigned MSEL36:1;
  unsigned MSEL37:1;
  unsigned MSEL38:1;
  unsigned MSEL39:1;
  unsigned MSEL40:1;
  unsigned MSEL41:1;
  unsigned MSEL42:1;
  unsigned MSEL43:1;
  unsigned MSEL44:1;
  unsigned MSEL45:1;
  unsigned MSEL46:1;
  unsigned MSEL47:1;
} ADL0MSEL2BITS;
extern volatile ADL0MSEL2BITS ADL0MSEL2bits __attribute__((__sfr__));

extern volatile unsigned int  ADL0MSEL3 __attribute__((__sfr__));
typedef struct tagADL0MSEL3BITS {
  unsigned MSEL48:1;
  unsigned MSEL49:1;
} ADL0MSEL3BITS;
extern volatile ADL0MSEL3BITS ADL0MSEL3bits __attribute__((__sfr__));

extern volatile unsigned long ADL1CON __attribute__((__sfr__));
extern volatile unsigned int  ADL1CONL __attribute__((__sfr__));
__extension__ typedef struct tagADL1CONLBITS {
  union {
    struct {
      unsigned SLSIZE:6;
      unsigned :1;
      unsigned THSRC:1;
      unsigned SLTSRC:5;
      unsigned SLENCLR:1;
      unsigned SAMP:1;
      unsigned SLEN:1;
    };
    struct {
      unsigned SLSIZE0:1;
      unsigned SLSIZE1:1;
      unsigned SLSIZE2:1;
      unsigned SLSIZE3:1;
      unsigned SLSIZE4:1;
      unsigned SLSIZE5:1;
      unsigned :2;
      unsigned SLTSRC0:1;
      unsigned SLTSRC1:1;
      unsigned SLTSRC2:1;
      unsigned SLTSRC3:1;
      unsigned SLTSRC4:1;
    };
  };
} ADL1CONLBITS;
extern volatile ADL1CONLBITS ADL1CONLbits __attribute__((__sfr__));

extern volatile unsigned int  ADL1CONH __attribute__((__sfr__));
__extension__ typedef struct tagADL1CONHBITS {
  union {
    struct {
      unsigned SAMC:5;
      unsigned MULCHEN:1;
      unsigned PINTRIS:1;
      unsigned CTMEN:1;
      unsigned CM:3;
      unsigned WM:2;
      unsigned SLINT:2;
      unsigned ASEN:1;
    };
    struct {
      unsigned SAMC0:1;
      unsigned SAMC1:1;
      unsigned SAMC2:1;
      unsigned SAMC3:1;
      unsigned SAMC4:1;
      unsigned :3;
      unsigned CM0:1;
      unsigned CM1:1;
      unsigned CM2:1;
      unsigned WM0:1;
      unsigned WM1:1;
      unsigned SLINT0:1;
      unsigned SLINT1:1;
    };
  };
} ADL1CONHBITS;
extern volatile ADL1CONHBITS ADL1CONHbits __attribute__((__sfr__));

extern volatile unsigned int  ADL1PTR __attribute__((__sfr__));
__extension__ typedef struct tagADL1PTRBITS {
  union {
    struct {
      unsigned :8;
      unsigned ADNEXT:7;
    };
    struct {
      unsigned :8;
      unsigned ADNEXT0:1;
      unsigned ADNEXT1:1;
      unsigned ADNEXT2:1;
      unsigned ADNEXT3:1;
      unsigned ADNEXT4:1;
      unsigned ADNEXT5:1;
      unsigned ADNEXT6:1;
    };
  };
} ADL1PTRBITS;
extern volatile ADL1PTRBITS ADL1PTRbits __attribute__((__sfr__));

extern volatile unsigned int  ADL1STAT __attribute__((__sfr__));
typedef struct tagADL1STATBITS {
  unsigned :5;
  unsigned ADLIF:1;
  unsigned :1;
  unsigned ADTDLY:1;
  unsigned :6;
  unsigned LBUSY:1;
  unsigned ADTACT:1;
} ADL1STATBITS;
extern volatile ADL1STATBITS ADL1STATbits __attribute__((__sfr__));

extern volatile unsigned int  ADTH1L __attribute__((__sfr__));
typedef struct tagADTH1LBITS {
  unsigned TH0:1;
  unsigned TH1:1;
  unsigned TH2:1;
  unsigned TH3:1;
  unsigned TH4:1;
  unsigned TH5:1;
  unsigned TH6:1;
  unsigned TH7:1;
  unsigned TH8:1;
  unsigned TH9:1;
  unsigned TH10:1;
  unsigned TH11:1;
  unsigned TH12:1;
  unsigned TH13:1;
  unsigned TH14:1;
  unsigned TH15:1;
} ADTH1LBITS;
extern volatile ADTH1LBITS ADTH1Lbits __attribute__((__sfr__));

extern volatile unsigned int  ADTH1H __attribute__((__sfr__));
typedef struct tagADTH1HBITS {
  unsigned TH0:1;
  unsigned TH1:1;
  unsigned TH2:1;
  unsigned TH3:1;
  unsigned TH4:1;
  unsigned TH5:1;
  unsigned TH6:1;
  unsigned TH7:1;
  unsigned TH8:1;
  unsigned TH9:1;
  unsigned TH10:1;
  unsigned TH11:1;
  unsigned TH12:1;
  unsigned TH13:1;
  unsigned TH14:1;
  unsigned TH15:1;
} ADTH1HBITS;
extern volatile ADTH1HBITS ADTH1Hbits __attribute__((__sfr__));

extern volatile unsigned long longADL1MSEL __attribute__((__sfr__));
extern volatile unsigned int  ADL1MSEL0 __attribute__((__sfr__));
typedef struct tagADL1MSEL0BITS {
  unsigned :15;
  unsigned MSEL15:1;
} ADL1MSEL0BITS;
extern volatile ADL1MSEL0BITS ADL1MSEL0bits __attribute__((__sfr__));

extern volatile unsigned int  ADL1MSEL1 __attribute__((__sfr__));
typedef struct tagADL1MSEL1BITS {
  unsigned MSEL16:1;
  unsigned MSEL17:1;
  unsigned MSEL18:1;
  unsigned MSEL19:1;
  unsigned MSEL20:1;
  unsigned MSEL21:1;
  unsigned MSEL22:1;
  unsigned MSEL23:1;
  unsigned MSEL24:1;
  unsigned MSEL25:1;
  unsigned MSEL26:1;
  unsigned MSEL27:1;
  unsigned MSEL28:1;
  unsigned MSEL29:1;
  unsigned MSEL30:1;
  unsigned MSEL31:1;
} ADL1MSEL1BITS;
extern volatile ADL1MSEL1BITS ADL1MSEL1bits __attribute__((__sfr__));

extern volatile unsigned int  ADL1MSEL2 __attribute__((__sfr__));
typedef struct tagADL1MSEL2BITS {
  unsigned MSEL32:1;
  unsigned MSEL33:1;
  unsigned MSEL34:1;
  unsigned MSEL35:1;
  unsigned MSEL36:1;
  unsigned MSEL37:1;
  unsigned MSEL38:1;
  unsigned MSEL39:1;
  unsigned MSEL40:1;
  unsigned MSEL41:1;
  unsigned MSEL42:1;
  unsigned MSEL43:1;
  unsigned MSEL44:1;
  unsigned MSEL45:1;
  unsigned MSEL46:1;
  unsigned MSEL47:1;
} ADL1MSEL2BITS;
extern volatile ADL1MSEL2BITS ADL1MSEL2bits __attribute__((__sfr__));

extern volatile unsigned int  ADL1MSEL3 __attribute__((__sfr__));
typedef struct tagADL1MSEL3BITS {
  unsigned MSEL48:1;
  unsigned MSEL49:1;
} ADL1MSEL3BITS;
extern volatile ADL1MSEL3BITS ADL1MSEL3bits __attribute__((__sfr__));

extern volatile unsigned long ADL2CON __attribute__((__sfr__));
extern volatile unsigned int  ADL2CONL __attribute__((__sfr__));
__extension__ typedef struct tagADL2CONLBITS {
  union {
    struct {
      unsigned SLSIZE:6;
      unsigned :1;
      unsigned THSRC:1;
      unsigned SLTSRC:5;
      unsigned SLENCLR:1;
      unsigned SAMP:1;
      unsigned SLEN:1;
    };
    struct {
      unsigned SLSIZE0:1;
      unsigned SLSIZE1:1;
      unsigned SLSIZE2:1;
      unsigned SLSIZE3:1;
      unsigned SLSIZE4:1;
      unsigned SLSIZE5:1;
      unsigned :2;
      unsigned SLTSRC0:1;
      unsigned SLTSRC1:1;
      unsigned SLTSRC2:1;
      unsigned SLTSRC3:1;
      unsigned SLTSRC4:1;
    };
  };
} ADL2CONLBITS;
extern volatile ADL2CONLBITS ADL2CONLbits __attribute__((__sfr__));

