IT-Church/FocRot_FW/C30/v3.31/support/PIC24F/h/p24FJ64GC008.h
/* ADL2MSEL2 */
/* Bitname _MSEL32 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL33 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL34 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL35 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL36 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL37 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL38 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL39 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL40 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL41 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL42 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL43 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL44 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL45 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL46 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL47 cannot be defined because it is used by more than one SFR */

/* ADL2MSEL3 */
/* Bitname _MSEL48 cannot be defined because it is used by more than one SFR */
/* Bitname _MSEL49 cannot be defined because it is used by more than one SFR */

/* LCDREG */
#define _CKSEL LCDREGbits.CKSEL
#define _MODE13 LCDREGbits.MODE13
#define _BIAS LCDREGbits.BIAS
#define _CPEN LCDREGbits.CPEN
#define _CKSEL0 LCDREGbits.CKSEL0
#define _CKSEL1 LCDREGbits.CKSEL1
#define _BIAS0 LCDREGbits.BIAS0
#define _BIAS1 LCDREGbits.BIAS1
#define _BIAS2 LCDREGbits.BIAS2

/* LCDREF */
#define _LRLAT LCDREFbits.LRLAT
#define _LRLBP LCDREFbits.LRLBP
#define _LRLAP LCDREFbits.LRLAP
#define _VLCD1PE LCDREFbits.VLCD1PE
#define _VLCD2PE LCDREFbits.VLCD2PE
#define _VLCD3PE LCDREFbits.VLCD3PE
#define _LCDCST LCDREFbits.LCDCST
#define _LCDIRE LCDREFbits.LCDIRE
#define _LRLAT0 LCDREFbits.LRLAT0
#define _LRLAT1 LCDREFbits.LRLAT1
#define _LRLAT2 LCDREFbits.LRLAT2
#define _LRLBP0 LCDREFbits.LRLBP0
#define _LRLBP1 LCDREFbits.LRLBP1
#define _LRLAP0 LCDREFbits.LRLAP0
#define _LRLAP1 LCDREFbits.LRLAP1
#define _LCDCST0 LCDREFbits.LCDCST0
#define _LCDCST1 LCDREFbits.LCDCST1
#define _LCDCST2 LCDREFbits.LCDCST2

/* LCDCON */
#define _LMUX LCDCONbits.LMUX
#define _CS LCDCONbits.CS
#define _WERR LCDCONbits.WERR
#define _SLPEN LCDCONbits.SLPEN
#define _LCDSIDL LCDCONbits.LCDSIDL
#define _LCDEN LCDCONbits.LCDEN
#define _LMUX0 LCDCONbits.LMUX0
#define _LMUX1 LCDCONbits.LMUX1
#define _LMUX2 LCDCONbits.LMUX2
#define _CS0 LCDCONbits.CS0
#define _CS1 LCDCONbits.CS1

/* LCDPS */
#define _LP LCDPSbits.LP
#define _WA LCDPSbits.WA
#define _LCDA LCDPSbits.LCDA
#define _BIASMD LCDPSbits.BIASMD
#define _WFT LCDPSbits.WFT
#define _LP0 LCDPSbits.LP0
#define _LP1 LCDPSbits.LP1
#define _LP2 LCDPSbits.LP2
#define _LP3 LCDPSbits.LP3

/* LCDDATA0 */
#define _S0C0 LCDDATA0bits.S0C0
#define _S1C0 LCDDATA0bits.S1C0
#define _S2C0 LCDDATA0bits.S2C0
#define _S3C0 LCDDATA0bits.S3C0
#define _S4C0 LCDDATA0bits.S4C0
#define _S5C0 LCDDATA0bits.S5C0
#define _S6C0 LCDDATA0bits.S6C0
#define _S7C0 LCDDATA0bits.S7C0
#define _S8C0 LCDDATA0bits.S8C0
#define _S9C0 LCDDATA0bits.S9C0
#define _S10C0 LCDDATA0bits.S10C0
#define _S11C0 LCDDATA0bits.S11C0
#define _S12C0 LCDDATA0bits.S12C0
#define _S13C0 LCDDATA0bits.S13C0
#define _S14C0 LCDDATA0bits.S14C0
#define _S15C0 LCDDATA0bits.S15C0

/* LCDDATA1 */
#define _S16C0 LCDDATA1bits.S16C0
#define _S17C0 LCDDATA1bits.S17C0
#define _S18C0 LCDDATA1bits.S18C0
#define _S19C0 LCDDATA1bits.S19C0
#define _S20C0 LCDDATA1bits.S20C0
#define _S21C0 LCDDATA1bits.S21C0
#define _S22C0 LCDDATA1bits.S22C0
#define _S23C0 LCDDATA1bits.S23C0
#define _S24C0 LCDDATA1bits.S24C0
#define _S25C0 LCDDATA1bits.S25C0
#define _S26C0 LCDDATA1bits.S26C0
#define _S27C0 LCDDATA1bits.S27C0
#define _S30C0 LCDDATA1bits.S30C0

/* LCDDATA2 */
#define _S32C0 LCDDATA2bits.S32C0
#define _S33C0 LCDDATA2bits.S33C0
#define _S34C0 LCDDATA2bits.S34C0
#define _S35C0 LCDDATA2bits.S35C0
#define _S36C0 LCDDATA2bits.S36C0
#define _S37C0 LCDDATA2bits.S37C0
#define _S38C0 LCDDATA2bits.S38C0
#define _S39C0 LCDDATA2bits.S39C0
#define _S40C0 LCDDATA2bits.S40C0
#define _S41C0 LCDDATA2bits.S41C0
#define _S42C0 LCDDATA2bits.S42C0
#define _S43C0 LCDDATA2bits.S43C0
#define _S44C0 LCDDATA2bits.S44C0
#define _S45C0 LCDDATA2bits.S45C0
#define _S46C0 LCDDATA2bits.S46C0
#define _S47C0 LCDDATA2bits.S47C0

/* LCDDATA3 */
#define _S48C0 LCDDATA3bits.S48C0
#define _S49C0 LCDDATA3bits.S49C0
#define _S62C0 LCDDATA3bits.S62C0
#define _S63C0 LCDDATA3bits.S63C0

/* LCDDATA4 */
#define _S0C1 LCDDATA4bits.S0C1
#define _S1C1 LCDDATA4bits.S1C1
#define _S2C1 LCDDATA4bits.S2C1
#define _S3C1 LCDDATA4bits.S3C1
#define _S4C1 LCDDATA4bits.S4C1
#define _S5C1 LCDDATA4bits.S5C1
#define _S6C1 LCDDATA4bits.S6C1
#define _S7C1 LCDDATA4bits.S7C1
#define _S8C1 LCDDATA4bits.S8C1
#define _S9C1 LCDDATA4bits.S9C1
#define _S10C1 LCDDATA4bits.S10C1
#define _S11C1 LCDDATA4bits.S11C1
#define _S12C1 LCDDATA4bits.S12C1
#define _S13C1 LCDDATA4bits.S13C1
#define _S14C1 LCDDATA4bits.S14C1
#define _S15C1 LCDDATA4bits.S15C1

/* LCDDATA5 */
#define _S16C1 LCDDATA5bits.S16C1
#define _S17C1 LCDDATA5bits.S17C1
#define _S18C1 LCDDATA5bits.S18C1
#define _S19C1 LCDDATA5bits.S19C1
#define _S20C1 LCDDATA5bits.S20C1
#define _S21C1 LCDDATA5bits.S21C1
#define _S22C1 LCDDATA5bits.S22C1
#define _S23C1 LCDDATA5bits.S23C1
#define _S24C1 LCDDATA5bits.S24C1
#define _S25C1 LCDDATA5bits.S25C1
#define _S26C1 LCDDATA5bits.S26C1
#define _S27C1 LCDDATA5bits.S27C1
#define _S30C1 LCDDATA5bits.S30C1
#define _S31C1 LCDDATA5bits.S31C1

/* LCDDATA6 */
#define _S32C1 LCDDATA6bits.S32C1
#define _S33C1 LCDDATA6bits.S33C1
#define _S34C1 LCDDATA6bits.S34C1
#define _S35C1 LCDDATA6bits.S35C1
#define _S36C1 LCDDATA6bits.S36C1
#define _S37C1 LCDDATA6bits.S37C1
#define _S38C1 LCDDATA6bits.S38C1
#define _S39C1 LCDDATA6bits.S39C1
#define _S40C1 LCDDATA6bits.S40C1
#define _S41C1 LCDDATA6bits.S41C1
#define _S42C1 LCDDATA6bits.S42C1
#define _S43C1 LCDDATA6bits.S43C1
#define _S44C1 LCDDATA6bits.S44C1
#define _S45C1 LCDDATA6bits.S45C1
#define _S46C1 LCDDATA6bits.S46C1
#define _S47C1 LCDDATA6bits.S47C1

/* LCDDATA7 */
#define _S48C1 LCDDATA7bits.S48C1
#define _S49C1 LCDDATA7bits.S49C1
#define _S62C1 LCDDATA7bits.S62C1
#define _S63C1 LCDDATA7bits.S63C1

/* LCDDATA8 */
#define _S0C2 LCDDATA8bits.S0C2
#define _S1C2 LCDDATA8bits.S1C2
#define _S2C2 LCDDATA8bits.S2C2
#define _S3C2 LCDDATA8bits.S3C2
#define _S4C2 LCDDATA8bits.S4C2
#define _S5C2 LCDDATA8bits.S5C2
#define _S6C2 LCDDATA8bits.S6C2
#define _S7C2 LCDDATA8bits.S7C2
#define _S8C2 LCDDATA8bits.S8C2
#define _S9C2 LCDDATA8bits.S9C2
#define _S10C2 LCDDATA8bits.S10C2
#define _S11C2 LCDDATA8bits.S11C2
#define _S12C2 LCDDATA8bits.S12C2
#define _S13C2 LCDDATA8bits.S13C2
#define _S14C2 LCDDATA8bits.S14C2
#define _S15C2 LCDDATA8bits.S15C2

/* LCDDATA9 */
#define _S16C2 LCDDATA9bits.S16C2
#define _S17C2 LCDDATA9bits.S17C2
#define _S18C2 LCDDATA9bits.S18C2
#define _S19C2 LCDDATA9bits.S19C2
#define _S20C2 LCDDATA9bits.S20C2
#define _S21C2 LCDDATA9bits.S21C2
#define _S22C2 LCDDATA9bits.S22C2
#define _S23C2 LCDDATA9bits.S23C2
#define _S24C2 LCDDATA9bits.S24C2
#define _S25C2 LCDDATA9bits.S25C2
#define _S26C2 LCDDATA9bits.S26C2
#define _S27C2 LCDDATA9bits.S27C2
#define _S30C2 LCDDATA9bits.S30C2
#define _S31C2 LCDDATA9bits.S31C2

