IT-Church/FocRot_FW/C30/v3.31/support/PIC24F/h/p24FJ64GC008.h
/* LCDDATA10 */
#define _S32C2 LCDDATA10bits.S32C2
#define _S33C2 LCDDATA10bits.S33C2
#define _S34C2 LCDDATA10bits.S34C2
#define _S35C2 LCDDATA10bits.S35C2
#define _S36C2 LCDDATA10bits.S36C2
#define _S37C2 LCDDATA10bits.S37C2
#define _S38C2 LCDDATA10bits.S38C2
#define _S39C2 LCDDATA10bits.S39C2
#define _S40C2 LCDDATA10bits.S40C2
#define _S41C2 LCDDATA10bits.S41C2
#define _S42C2 LCDDATA10bits.S42C2
#define _S43C2 LCDDATA10bits.S43C2
#define _S44C2 LCDDATA10bits.S44C2
#define _S45C2 LCDDATA10bits.S45C2
#define _S46C2 LCDDATA10bits.S46C2
#define _S47C2 LCDDATA10bits.S47C2

/* LCDDATA11 */
#define _S48C2 LCDDATA11bits.S48C2
#define _S49C2 LCDDATA11bits.S49C2
#define _S62C2 LCDDATA11bits.S62C2
#define _S63C2 LCDDATA11bits.S63C2

/* LCDDATA12 */
#define _S0C3 LCDDATA12bits.S0C3
#define _S1C3 LCDDATA12bits.S1C3
#define _S2C3 LCDDATA12bits.S2C3
#define _S3C3 LCDDATA12bits.S3C3
#define _S4C3 LCDDATA12bits.S4C3
#define _S5C3 LCDDATA12bits.S5C3
#define _S6C3 LCDDATA12bits.S6C3
#define _S7C3 LCDDATA12bits.S7C3
#define _S8C3 LCDDATA12bits.S8C3
#define _S9C3 LCDDATA12bits.S9C3
#define _S10C3 LCDDATA12bits.S10C3
#define _S11C3 LCDDATA12bits.S11C3
#define _S12C3 LCDDATA12bits.S12C3
#define _S13C3 LCDDATA12bits.S13C3
#define _S14C3 LCDDATA12bits.S14C3
#define _S15C3 LCDDATA12bits.S15C3

/* LCDDATA13 */
#define _S16C3 LCDDATA13bits.S16C3
#define _S17C3 LCDDATA13bits.S17C3
#define _S18C3 LCDDATA13bits.S18C3
#define _S19C3 LCDDATA13bits.S19C3
#define _S20C3 LCDDATA13bits.S20C3
#define _S21C3 LCDDATA13bits.S21C3
#define _S22C3 LCDDATA13bits.S22C3
#define _S23C3 LCDDATA13bits.S23C3
#define _S24C3 LCDDATA13bits.S24C3
#define _S25C3 LCDDATA13bits.S25C3
#define _S26C3 LCDDATA13bits.S26C3
#define _S27C3 LCDDATA13bits.S27C3
#define _S30C3 LCDDATA13bits.S30C3
#define _S31C3 LCDDATA13bits.S31C3

/* LCDDATA14 */
#define _S32C3 LCDDATA14bits.S32C3
#define _S33C3 LCDDATA14bits.S33C3
#define _S34C3 LCDDATA14bits.S34C3
#define _S35C3 LCDDATA14bits.S35C3
#define _S36C3 LCDDATA14bits.S36C3
#define _S37C3 LCDDATA14bits.S37C3
#define _S38C3 LCDDATA14bits.S38C3
#define _S39C3 LCDDATA14bits.S39C3
#define _S40C3 LCDDATA14bits.S40C3
#define _S41C3 LCDDATA14bits.S41C3
#define _S42C3 LCDDATA14bits.S42C3
#define _S43C3 LCDDATA14bits.S43C3
#define _S44C3 LCDDATA14bits.S44C3
#define _S45C3 LCDDATA14bits.S45C3
#define _S46C3 LCDDATA14bits.S46C3
#define _S47C3 LCDDATA14bits.S47C3

/* LCDDATA15 */
#define _S48C3 LCDDATA15bits.S48C3
#define _S49C3 LCDDATA15bits.S49C3
#define _S62C3 LCDDATA15bits.S62C3
#define _S63C3 LCDDATA15bits.S63C3

/* LCDDATA16 */
#define _S0C4 LCDDATA16bits.S0C4
#define _S1C4 LCDDATA16bits.S1C4
#define _S2C4 LCDDATA16bits.S2C4
#define _S3C4 LCDDATA16bits.S3C4
#define _S4C4 LCDDATA16bits.S4C4
#define _S5C4 LCDDATA16bits.S5C4
#define _S6C4 LCDDATA16bits.S6C4
#define _S7C4 LCDDATA16bits.S7C4
#define _S8C4 LCDDATA16bits.S8C4
#define _S9C4 LCDDATA16bits.S9C4
#define _S10C4 LCDDATA16bits.S10C4
#define _S11C4 LCDDATA16bits.S11C4
#define _S12C4 LCDDATA16bits.S12C4
#define _S13C4 LCDDATA16bits.S13C4
#define _S14C4 LCDDATA16bits.S14C4
#define _S15C4 LCDDATA16bits.S15C4

/* LCDDATA17 */
#define _S16C4 LCDDATA17bits.S16C4
#define _S17C4 LCDDATA17bits.S17C4
#define _S18C4 LCDDATA17bits.S18C4
#define _S19C4 LCDDATA17bits.S19C4
#define _S20C4 LCDDATA17bits.S20C4
#define _S21C4 LCDDATA17bits.S21C4
#define _S22C4 LCDDATA17bits.S22C4
#define _S23C4 LCDDATA17bits.S23C4
#define _S24C4 LCDDATA17bits.S24C4
#define _S25C4 LCDDATA17bits.S25C4
#define _S26C4 LCDDATA17bits.S26C4
#define _S27C4 LCDDATA17bits.S27C4
#define _S30C4 LCDDATA17bits.S30C4
#define _S31C4 LCDDATA17bits.S31C4

/* LCDDATA18 */
#define _S32C4 LCDDATA18bits.S32C4
#define _S33C4 LCDDATA18bits.S33C4
#define _S34C4 LCDDATA18bits.S34C4
#define _S35C4 LCDDATA18bits.S35C4
#define _S36C4 LCDDATA18bits.S36C4
#define _S37C4 LCDDATA18bits.S37C4
#define _S38C4 LCDDATA18bits.S38C4
#define _S39C4 LCDDATA18bits.S39C4
#define _S40C4 LCDDATA18bits.S40C4
#define _S41C4 LCDDATA18bits.S41C4
#define _S42C4 LCDDATA18bits.S42C4
#define _S43C4 LCDDATA18bits.S43C4
#define _S44C4 LCDDATA18bits.S44C4
#define _S45C4 LCDDATA18bits.S45C4
#define _S46C4 LCDDATA18bits.S46C4
#define _S47C4 LCDDATA18bits.S47C4

/* LCDDATA19 */
#define _S48C4 LCDDATA19bits.S48C4
#define _S49C4 LCDDATA19bits.S49C4
#define _S62C4 LCDDATA19bits.S62C4
#define _S63C4 LCDDATA19bits.S63C4

/* LCDDATA20 */
#define _S0C5 LCDDATA20bits.S0C5
#define _S1C5 LCDDATA20bits.S1C5
#define _S2C5 LCDDATA20bits.S2C5
#define _S3C5 LCDDATA20bits.S3C5
#define _S4C5 LCDDATA20bits.S4C5
#define _S5C5 LCDDATA20bits.S5C5
#define _S6C5 LCDDATA20bits.S6C5
#define _S7C5 LCDDATA20bits.S7C5
#define _S8C5 LCDDATA20bits.S8C5
#define _S9C5 LCDDATA20bits.S9C5
#define _S10C5 LCDDATA20bits.S10C5
#define _S11C5 LCDDATA20bits.S11C5
#define _S12C5 LCDDATA20bits.S12C5
#define _S13C5 LCDDATA20bits.S13C5
#define _S14C5 LCDDATA20bits.S14C5
#define _S15C5 LCDDATA20bits.S15C5

/* LCDDATA21 */
#define _S16C5 LCDDATA21bits.S16C5
#define _S17C5 LCDDATA21bits.S17C5
#define _S18C5 LCDDATA21bits.S18C5
#define _S19C5 LCDDATA21bits.S19C5
#define _S20C5 LCDDATA21bits.S20C5
#define _S21C5 LCDDATA21bits.S21C5
#define _S22C5 LCDDATA21bits.S22C5
#define _S23C5 LCDDATA21bits.S23C5
#define _S24C5 LCDDATA21bits.S24C5
#define _S25C5 LCDDATA21bits.S25C5
#define _S26C5 LCDDATA21bits.S26C5
#define _S27C5 LCDDATA21bits.S27C5
#define _S30C5 LCDDATA21bits.S30C5
#define _S31C5 LCDDATA21bits.S31C5

/* LCDDATA22 */
#define _S32C5 LCDDATA22bits.S32C5
#define _S33C5 LCDDATA22bits.S33C5
#define _S34C5 LCDDATA22bits.S34C5
#define _S35C5 LCDDATA22bits.S35C5
#define _S36C5 LCDDATA22bits.S36C5
#define _S37C5 LCDDATA22bits.S37C5
#define _S38C5 LCDDATA22bits.S38C5
#define _S39C5 LCDDATA22bits.S39C5
#define _S40C5 LCDDATA22bits.S40C5
#define _S41C5 LCDDATA22bits.S41C5
#define _S42C5 LCDDATA22bits.S42C5
#define _S43C5 LCDDATA22bits.S43C5
#define _S44C5 LCDDATA22bits.S44C5
#define _S45C5 LCDDATA22bits.S45C5
#define _S46C5 LCDDATA22bits.S46C5
#define _S47C5 LCDDATA22bits.S47C5

/* LCDDATA23 */
#define _S48C5 LCDDATA23bits.S48C5
#define _S49C5 LCDDATA23bits.S49C5
#define _S62C5 LCDDATA23bits.S62C5
#define _S63C5 LCDDATA23bits.S63C5

/* LCDDATA24 */
#define _S0C6 LCDDATA24bits.S0C6
#define _S1C6 LCDDATA24bits.S1C6
#define _S2C6 LCDDATA24bits.S2C6
#define _S3C6 LCDDATA24bits.S3C6
#define _S4C6 LCDDATA24bits.S4C6
#define _S5C6 LCDDATA24bits.S5C6
#define _S6C6 LCDDATA24bits.S6C6
#define _S7C6 LCDDATA24bits.S7C6
#define _S8C6 LCDDATA24bits.S8C6
#define _S9C6 LCDDATA24bits.S9C6
#define _S10C6 LCDDATA24bits.S10C6
#define _S11C6 LCDDATA24bits.S11C6
#define _S12C6 LCDDATA24bits.S12C6
#define _S13C6 LCDDATA24bits.S13C6
#define _S14C6 LCDDATA24bits.S14C6
#define _S15C6 LCDDATA24bits.S15C6

/* LCDDATA25 */
#define _S16C6 LCDDATA25bits.S16C6
#define _S17C6 LCDDATA25bits.S17C6
#define _S18C6 LCDDATA25bits.S18C6
#define _S19C6 LCDDATA25bits.S19C6
#define _S20C6 LCDDATA25bits.S20C6
#define _S21C6 LCDDATA25bits.S21C6
#define _S22C6 LCDDATA25bits.S22C6
#define _S23C6 LCDDATA25bits.S23C6
#define _S24C6 LCDDATA25bits.S24C6
#define _S25C6 LCDDATA25bits.S25C6
#define _S26C6 LCDDATA25bits.S26C6
#define _S27C6 LCDDATA25bits.S27C6
#define _S30C6 LCDDATA25bits.S30C6
#define _S31C6 LCDDATA25bits.S31C6

